docs/computing-gcd-of-n-polynomials.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Computing Greatest Common Divisor of N polynomials</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />

</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Computing Greatest Common Divisor of N polynomials</h1>
</header><p>
Unfortunately, most of the time the math being programmed is limited by only numbers.  Plotting functions, computing some numbers, counting etc.  Symbolic computations are often avoided as they're thought hard for some reason.  In this article I'll show that's not true.  By using proper and expressive tools, such as functional programming, it is very easy to do computation with higher level mathematical objects like polynomials.
</p>

<p>
The problem that I'm solving here was my homework, except our teacher assumed that we're going to do all calculations by hand.  As a functional programming enthusiast I wanted to solve this problem using programming.  I used the <a href="https://ocaml.org">OCaml</a> programming language.  I'm new to this language, so my code might look a bit dumb.  Also, most of the functions listed here can be <a href="https://en.wikipedia.org/wiki/Tail_call">tail call optimized</a>, but performance was the last thing I cared of.
</p>

<div id="outline-container-org1905a75" class="outline-2">
<h2 id="org1905a75">Introduction</h2>
<div class="outline-text-2" id="text-org1905a75">
<p>
Polynomials are mathematical objects that look like this: \(f(x) = a_0 + a_1 x + \dots + a_n x^n\).  Here \(a_0\), \(a_1\), \(\dots\) and \(a_n\) are elements of a set that we'll be calling a set of <b>numbers</b>.  Those numbers can be anything: integers, rational numbers, real numbers, complex numbers, you name it .  The only restriction is that this set must be a <a href="https://en.wikipedia.org/wiki/Ring_(mathematics)">ring</a> with commutative multiplication.  The number \(n\) in polynomial is called the <b>degree</b> of polynomial.  It's usually written as \(deg f\).
</p>

<p>
With these facts in mind, it is possible to define polynomial addition, subtraction, multiplication and even <a href="https://en.wikipedia.org/wiki/Polynomial_long_division">division</a>.  These operations are exactly the operations needed for <a href="https://en.wikipedia.org/wiki/Euclidean_algorithm">Euclidean algorithm</a> to work.  Yes, Euclidean algorithm can work with anything! It just needs <b>objects</b>, that it's operating on, behave like numbers.
</p>
</div>
</div>

<div id="outline-container-org5a76a55" class="outline-2">
<h2 id="org5a76a55">Basic operations</h2>
<div class="outline-text-2" id="text-org5a76a55">
<p>
Let's start with code.  I suggest to make functions for operations on numbers, so we'll be able to easily change the set that we're operating on.
</p>

<div class="org-src-container">
<pre class="src src-tuareg"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold;">num_add</span> <span style="font-weight: bold; font-style: italic;">a</span> <span style="font-weight: bold; font-style: italic;">b</span> = (a +. b)
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold;">num_sub</span> <span style="font-weight: bold; font-style: italic;">a</span> <span style="font-weight: bold; font-style: italic;">b</span> = (a -. b)
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold;">num_mul</span> <span style="font-weight: bold; font-style: italic;">a</span> <span style="font-weight: bold; font-style: italic;">b</span> = (a *. b)
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold;">num_div</span> <span style="font-weight: bold; font-style: italic;">a</span> <span style="font-weight: bold; font-style: italic;">b</span> = (a /. b)
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">num_zero</span> = 0.
</pre>
</div>

<p>
Here we defined our operations working on float numbers.  It is also possible to make operations for <a href="https://en.wikipedia.org/wiki/Multiplicative_group_of_integers_modulo_n">group of integers modulo 7</a>:
</p>

<div class="org-src-container">
<pre class="src src-tuareg"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">p</span> = 7
<span style="color: #f5deb3; font-weight: bold;">let</span> (<span style="color: #f0e68c;">mod</span>) <span style="font-weight: bold; font-style: italic;">x</span> <span style="font-weight: bold; font-style: italic;">y</span> = ((x <span style="color: #f0e68c;">mod</span> y) + y) <span style="color: #f0e68c;">mod</span> y
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold;">num_add</span> <span style="font-weight: bold; font-style: italic;">a</span> <span style="font-weight: bold; font-style: italic;">b</span> = (a + b) <span style="color: #f0e68c;">mod</span> p
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold;">num_sub</span> <span style="font-weight: bold; font-style: italic;">a</span> <span style="font-weight: bold; font-style: italic;">b</span> = (a - b) <span style="color: #f0e68c;">mod</span> p
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold;">num_mul</span> <span style="font-weight: bold; font-style: italic;">a</span> <span style="font-weight: bold; font-style: italic;">b</span> = (a * b) <span style="color: #f0e68c;">mod</span> p
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold;">num_div</span> <span style="font-weight: bold; font-style: italic;">a</span> <span style="font-weight: bold; font-style: italic;">b</span> =
  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="font-weight: bold;">pow_mod</span> <span style="font-weight: bold; font-style: italic;">a</span> <span style="font-weight: bold; font-style: italic;">b</span> =
    <span style="font-weight: bold;">if</span> b = 0 <span style="font-weight: bold;">then</span> 1
    <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">if</span> b = 1 <span style="font-weight: bold;">then</span> a <span style="color: #f0e68c;">mod</span> p
    <span style="font-weight: bold;">else</span> a * (pow_mod a (b-1)) <span style="color: #f5deb3; font-weight: bold;">in</span>
  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">b_inv</span> = pow_mod b (p-2) <span style="color: #f5deb3; font-weight: bold;">in</span>
  (a * b_inv) <span style="color: #f0e68c;">mod</span> p
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">num_zero</span> = 0
</pre>
</div>

<p>
Obvisouly, you can make use of any type of "numbers".  As I said they just must be a ring with commutative multiplication.
</p>

<p>
In our code we will use polynomials as lists.  First element of polynomial will be \(a_0\) and last one will be \(a_n\).  Let's define simple operations on our polynomials.  Next two operations are so easy that I won't even elaborate on them:
</p>

<div class="org-src-container">
<pre class="src src-tuareg"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold;">add_poly</span> <span style="font-weight: bold; font-style: italic;">a</span> <span style="font-weight: bold; font-style: italic;">b</span> =
  <span style="font-weight: bold; text-decoration: underline;">List.</span>map2 num_add a b

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold;">sub_poly</span> <span style="font-weight: bold; font-style: italic;">a</span> <span style="font-weight: bold; font-style: italic;">b</span> =
  <span style="font-weight: bold; text-decoration: underline;">List.</span>map2 num_sub a b
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b24fa2" class="outline-2">
<h2 id="org8b24fa2">Helper functions</h2>
<div class="outline-text-2" id="text-org8b24fa2">
<p>
We'd want to print our polynomials in nice way.  Here is a function that converts polynomial to string, skipping zeros:
</p>

<div class="org-src-container">
<pre class="src src-tuareg"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="font-weight: bold;">print_poly</span> <span style="font-weight: bold; font-style: italic;">a</span> <span style="font-weight: bold; font-style: italic;">i</span> = <span style="font-weight: bold;">match</span> a <span style="font-weight: bold;">with</span>
  | [] -&gt; <span style="font-style: italic;">""</span>
  | x :: t -&gt;
     <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">s</span> = <span style="font-weight: bold;">if</span> x == num_zero <span style="font-weight: bold;">then</span> <span style="font-style: italic;">""</span>
             <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">if</span> i == 0 <span style="font-weight: bold;">then</span> <span style="font-weight: bold; text-decoration: underline;">Printf.</span>sprintf <span style="font-style: italic;">"+%f"</span> x
             <span style="font-weight: bold;">else</span> <span style="font-weight: bold; text-decoration: underline;">Printf.</span>sprintf <span style="font-style: italic;">"+%fx^%d"</span> x i
     <span style="color: #f5deb3; font-weight: bold;">in</span> s <span style="color: #f0e68c;">^</span> (print_poly t (i+1))
</pre>
</div>

<p>
So, <code>print_poly [1; 2; 0; 3] 0</code> evaluates to <code>+1.000000+2.000000x^1+0.000000x^2+3.000000x^3</code>.  Note that each next function we'll write is tested using <code>print_poly</code> making sure nothing is wrong.
</p>

<p>
We'd want a function that returns a polynomial of degree \(n\) filled with zeros.  Here it is:
</p>

<div class="org-src-container">
<pre class="src src-tuareg"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="font-weight: bold;">zeros</span> = <span style="font-weight: bold;">function</span>
  | 0 -&gt; []
  | n -&gt; [num_zero] <span style="color: #f0e68c;">@</span> (zeros (n-1))
</pre>
</div>

<p>
Unfortunately, I didn't find a function that drops last element of a list in <code>OCaml</code>'s standard library.  It can be implemented like this:
</p>

<div class="org-src-container">
<pre class="src src-tuareg"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="font-weight: bold;">drop_last</span> <span style="font-weight: bold; font-style: italic;">a</span> =
  a <span style="color: #f0e68c;">|&gt;</span> <span style="font-weight: bold; text-decoration: underline;">List.</span>rev <span style="color: #f0e68c;">|&gt;</span> <span style="font-weight: bold; text-decoration: underline;">List.</span>tl <span style="color: #f0e68c;">|&gt;</span> <span style="font-weight: bold; text-decoration: underline;">List.</span>rev
</pre>
</div>
</div>
</div>

<div id="outline-container-org293db18" class="outline-2">
<h2 id="org293db18">Division</h2>
<div class="outline-text-2" id="text-org293db18">
<p>
Okay, we're faced with a serious task.  I think, if we were using imperative language it'd be hard to solve our task.  We would write nested for loops with counters which most likely would lead to a bug.  With <code>OCaml</code> I wrote function for division first try.  It's 10 lines of code.  I think one great thing about functional programming is that it forces you to reuse code by using recursion.  This approach perfectly fits higher level math.  Anyway, here's code:
</p>

<div class="org-src-container">
<pre class="src src-tuareg"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="font-weight: bold;">div_poly</span> <span style="font-weight: bold; font-style: italic;">a</span> <span style="font-weight: bold; font-style: italic;">b</span> =
  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">d1</span> = deg_poly a <span style="color: #f5deb3; font-weight: bold;">in</span>
  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">d2</span> = deg_poly b <span style="color: #f5deb3; font-weight: bold;">in</span>
  <span style="font-weight: bold;">if</span> d1 &lt; d2 <span style="font-weight: bold;">then</span> ([], a)
  <span style="font-weight: bold;">else</span>
    <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">l1</span> = <span style="font-weight: bold; text-decoration: underline;">List.</span>length a <span style="color: #f5deb3; font-weight: bold;">and</span> <span style="font-weight: bold; font-style: italic;">l2</span> = <span style="font-weight: bold; text-decoration: underline;">List.</span>length b <span style="color: #f5deb3; font-weight: bold;">in</span>
    <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">g</span> = (num_div (<span style="font-weight: bold; text-decoration: underline;">List.</span>nth a (l1-1)) (<span style="font-weight: bold; text-decoration: underline;">List.</span>nth b (l2-1))) <span style="color: #f5deb3; font-weight: bold;">in</span>
    <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">c</span> = mul_poly b g (d1-d2) <span style="color: #f5deb3; font-weight: bold;">in</span>
    <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">ch</span>, <span style="font-weight: bold; font-style: italic;">ost</span> = (div_poly (drop_last (sub_poly a c)) b) <span style="color: #f5deb3; font-weight: bold;">in</span>
    (ch <span style="color: #f0e68c;">@</span> [g], ost)
</pre>
</div>

<p>
This function takes two polynomials and returns tuple consisting of <code>quotient</code> and <code>reminder</code> of division.
</p>
</div>
</div>

<div id="outline-container-orgc468a8c" class="outline-2">
<h2 id="orgc468a8c">Greatest Common Divisor</h2>
<div class="outline-text-2" id="text-orgc468a8c">
<p>
This is just a classic Euclidean algorithm, nothing special about it:
</p>

<div class="org-src-container">
<pre class="src src-tuareg"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="font-weight: bold;">gcd_poly</span> <span style="font-weight: bold; font-style: italic;">a</span> <span style="font-weight: bold; font-style: italic;">b</span> =
  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">d1</span> = deg_poly a <span style="color: #f5deb3; font-weight: bold;">in</span>
  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">d2</span> = deg_poly b <span style="color: #f5deb3; font-weight: bold;">in</span>
  <span style="font-weight: bold;">if</span> d1 &lt; d2 <span style="font-weight: bold;">then</span> gcd_poly b a
  <span style="font-weight: bold;">else</span>
    <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">q</span>, <span style="font-weight: bold; font-style: italic;">r</span> = div_poly a b <span style="color: #f5deb3; font-weight: bold;">in</span>
    <span style="font-weight: bold;">if</span> r == [] <span style="font-weight: bold;">then</span> a
    <span style="font-weight: bold;">else</span> gcd_poly b r
</pre>
</div>

<p>
If you're following this article coding yourself then don't be lazy and make some tests.  They will help a lot in understanding.
</p>

<p>
Having the <code>gcd_poly</code> function it's very easy to create a function that will compute <b>gcd</b> of N polynomials.  It's just gorgeous:
</p>

<div class="org-src-container">
<pre class="src src-tuareg"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="font-weight: bold;">gcd_poly_n</span> = <span style="font-weight: bold;">function</span>
  | [] -&gt; <span style="font-weight: bold;">raise</span> (<span style="font-weight: bold;">Invalid_argument</span> <span style="font-style: italic;">"error"</span>)
  | [a] -&gt; a
  | h :: t -&gt; gcd_poly h (gcd_poly_n t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdcafca7" class="outline-2">
<h2 id="orgdcafca7">Conclusion</h2>
<div class="outline-text-2" id="text-orgdcafca7">
<p>
The problem from my homework was to compute <b>gcd</b> of 3 polynomials: \(f(x) = x^4 - 2 x^2 + 4\), \(g(x) = x^4 - 4 x^2 + 4 x - 1\), \(h(x) = x^4 - 4 x^2 + 4 x - 1\).  Those polynomials operated on group of integers modulo 7.  The result is \(2x+2\).
</p>

<p>
It was a fun experience.  I'm starting to like functional programming more and more.  Someone might say that it's not very suitable for some types of problems.  However, I think for solving mathematical problems functional programming fits the best.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-05-30</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>